app/controllers/events_controller.rb

INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "qq"], ["description", "123"], ["created_at", "2017-09-08 03:38:55.968024"], ["updated_at", "2017-09-08 03:38:55.968024"]]
---
  def create
    @event = Event.new(event_params)
    @event.save

UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "dddd"], ["updated_at", "2017-09-08 04:05:52.649014"], ["id", 2]]
---
  def update
    @event.update(event_params)